using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Vcyber.BLMS.Entity.Enum
{
    /// <summary>
    /// 短信类型
    /// </summary>
    public enum ESmsType
    {
        注册成功 = 1,

        提交注册_发送验证码 = 2,

        提交注册_未匹配到索九车 = 3,

        提交注册_匹配到车辆 = 4,

        找回密码 = 6,

        重置密码 = 7,

        新购LF车主 = 8,

        换购增购LF车主 = 9,

        积分支付 = 10,

        蓝豆支付 = 11,

        支付完成_bluemembers银卡会员 = 12,

        后台订单发货 = 14,

        消耗积分发送验证码 = 15,

        消费管理_积分消耗成功 = 16,

        消费管理_审核通过 = 17,

        预约_预约成功 = 18,

        上门关怀_索九会员 = 19,

        上门关怀_上门关怀服务预约成功后提示 = 20,

        机场服务_预约成功下发短信 = 21,

        机场服务_免费兑换次数用完告知短信 = 22,

        机场服务_成功使用服务码告知短信 = 23,

        机场服务_编码使用记录告知短信 = 24,

        机场服务_编码过期告知短信 = 25,

        电子卡券 = 30,

        后台新增会员=32,

        通过认证 = 33,

        新增会员不返积分=34,
        
        车辆养护产品5种=40,
        
        动态密码登陆注册成功=35,
        电子影票 = 36
    }
}
